#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/studyforschool/learn-terraform-github-actions_2/runs/run-4n5TShGdcjENMNjh

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=smashing-jaybird]
aws_security_group.web-sg: Refreshing state... [id=sg-0f46a0239fd8041c8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.web-sg must be replaced
-/+ resource "aws_security_group" "web-sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:242201297848:security-group/sg-0f46a0239fd8041c8" -> (known after apply)
      ~ id                     = "sg-0f46a0239fd8041c8" -> (known after apply)
      ~ name                   = "smashing-jaybird-sg" -> "sg01" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "242201297848" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-00117d9f28a591bcb" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # random_pet.sg will be destroyed
  - resource "random_pet" "sg" {
      - id        = "smashing-jaybird" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BIGDADDY5802, Action: `pull_request`*